run/flowthermal/FTL-Lesson8/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          494;
        startFace       558495;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       558989;
    }
    ground
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6310;
        startFace       559189;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          1000;
        startFace       565499;
    }
    buildings
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          22723;
        startFace       566499;
    }
)

// ************************************************************************* //
